In [58]:
import pandas as pd
import numpy as np

In [45]:
food_data =  pd.read_csv('FoodBalanceSheets_E_Africa_NOFLAG.csv', encoding='latin-1')

In [46]:
food_data.head(2)

,Area Code,Area,Item Code,Item,Element Code,Element,Unit,Y2014,Y2015,Y2016,Y2017,Y2018
0,4,Algeria,2501,Population,511,Total Population - Both sexes,1000 persons,38924.0,39728.0,40551.0,41389.0,42228.0
1,4,Algeria,2501,Population,5301,Domestic supply quantity,1000 tonnes,0.0,0.0,0.0,0.0,0.0

In [47]:
food_data.columns

Index(['Area Code', 'Area', 'Item Code', 'Item', 'Element Code', 'Element',
       'Unit', 'Y2014', 'Y2015', 'Y2016', 'Y2017', 'Y2018'],
      dtype='object')

In [48]:
food_data.shape

(60943, 12)

## Answering the quiz questions

In [97]:
#Question 1: Y2016
food_data.corr()

,Area Code,Item Code,Element Code,Y2014,Y2015,Y2016,Y2017,Y2018
Area Code,1.000000,-0.005159,-0.000209,0.006164,0.005472,0.005247,0.005006,0.005665
Item Code,-0.005159,1.000000,-0.024683,0.021722,0.020857,0.020109,0.021494,0.021314
Element Code,-0.000209,-0.024683,1.000000,0.024457,0.023889,0.023444,0.024254,0.024279
Y2014,0.006164,0.021722,0.024457,1.000000,0.994647,0.996081,0.995230,0.994872
Y2015,0.005472,0.020857,0.023889,0.994647,1.000000,0.995739,0.988048,0.988208
Y2016,0.005247,0.020109,0.023444,0.996081,0.995739,1.000000,0.992785,0.992757
Y2017,0.005006,0.021494,0.024254,0.995230,0.988048,0.992785,1.000000,0.998103
Y2018,0.005665,0.021314,0.024279,0.994872,0.988208,0.992757,0.998103,1.000000

In [116]:
#Question 2:
#Consider the following list of tuples:

#y = [(2, 4), (7, 8), (1, 5, 9)]

#How would you assign element 8 from the list to a variable x?
y = [(2,4),(7,8),(1,5,9)]

In [118]:
x = y[1][1]
x

8

In [119]:
x = y[1][-1]
x

8

In [120]:
#Question 3: What is the total number of unique countries in the dataset?
food_data['Area'].nunique()

49

In [121]:
#Question 4:
#What is the total number and percentage of missing data in 2014 to 3 decimal places?

food_data.isnull().sum()

Area Code          0
Area               0
Item Code          0
Item               0
Element Code       0
Element            0
Unit               0
Y2014           1589
Y2015           1548
Y2016           1535
Y2017           1506
Y2018           1436
dtype: int64

In [123]:
(1589/food_data['Y2014'].count()) * 100

2.6771573946153584

In [124]:
#Question 5:
Given the following python code, what would the output of the code give?

my_tuppy = (1,2,5,8)

my_tuppy[2] = 6

Object `give` not found.

TypeError: 'tuple' object does not support item assignment

In [126]:
#Question 6:
#What would be the output for?

#S = [['him', 'sell'], [90, 28, 43]]

#S[0][1][1]
S = [['him','sell'], [90,28,43]]
S[0][1][1]

'e'

In [130]:
#Question 8:
#Perform a groupby operation on ‘Element’.  What is the total number of the sum of Processing in 2017?

#food_data.groupby('Element')['Y2014','Y2015', 'Y2016','Y2017', 'Y2018'].sum()
food_data.groupby('Element')['Y2014','Y2015', 'Y2016','Y2017', 'Y2018'].sum().loc['Processing']['Y2017']

/var/folders/kc/0t29xd2n6cs931b6rpqcgzk40000gp/T/ipykernel_33516/978266173.py:5: FutureWarning: Indexing with multiple keys (implicitly converted to a tuple of keys) will be deprecated, use a list instead.
  food_data.groupby('Element')['Y2014','Y2015', 'Y2016','Y2017', 'Y2018'].sum().loc['Processing']['Y2017']

292836.0

In [133]:
#Question 9: 
#Perform a groupby operation on ‘Element’.  What year has the highest sum of Stock Variation?

food_data.groupby('Element')['Y2014','Y2015', 'Y2016','Y2017', 'Y2018'].sum().loc['Stock Variation']

/var/folders/kc/0t29xd2n6cs931b6rpqcgzk40000gp/T/ipykernel_33516/3334497738.py:4: FutureWarning: Indexing with multiple keys (implicitly converted to a tuple of keys) will be deprecated, use a list instead.
  food_data.groupby('Element')['Y2014','Y2015', 'Y2016','Y2017', 'Y2018'].sum().loc['Stock Variation']

Y2014    58749.83
Y2015    34910.99
Y2016    33140.12
Y2017    54316.91
Y2018    20577.91
Name: Stock Variation, dtype: float64

In [134]:
#Question 10:
#If you have the following list

#lst = [[35, 'Portugal', 94], [33, 'Argentina', 93], [30 , 'Brazil', 92]]

#col = [‘Age’,’Nationality’,’Overall’]

#How do you create a pandas DataFrame using this list, to look like the table below?

lst = [[35, 'Portugal',94], [33, 'Argentina',93], [30, 'Brazil', 92]]
col = ['Age', 'Natinality','Overall']

In [135]:
pd.DataFrame(lst,columns=col, index=[1,2,3])

   Age Natinality  Overall
1   35   Portugal       94
2   33  Argentina       93
3   30     Brazil       92

In [136]:
pd.DataFrame(lst,columns=['Age', 'Natinality','Overall'], index=[1,2,3])

   Age Natinality  Overall
1   35   Portugal       94
2   33  Argentina       93
3   30     Brazil       92

In [137]:
pd.DataFrame(lst,columns=col, index=[i for i in range(1,4)])

   Age Natinality  Overall
1   35   Portugal       94
2   33  Argentina       93
3   30     Brazil       92

In [139]:
#Question 11:
#Answer the following questions based on the African food production dataset provided by the FAO website already provided

#What is the total sum of Wine produced in 2015 and 2018 respectively?

#Hint:

#Perform a groupby sum aggregation on ‘Item’
food_data.groupby('Item').sum().loc['Wine']

Area Code         66206.00
Item Code       1319535.00
Element Code    1818328.00
Y2014              4497.36
Y2015              4251.81
Y2016              3872.09
Y2017              4178.02
Y2018              4039.32
Name: Wine, dtype: float64

In [141]:
#Question 12:
#Select columns ‘Y2017’ and ‘Area’, Perform a groupby operation on ‘Area’.  
# Which of these Areas had the 7th lowest sum in 2017?
ft_2017 = food_data[['Y2017','Area']]
ft_2017.groupby('Area').sum().sort_values(by='Y2017').iloc[6]

Y2017    19102.77
Name: Guinea-Bissau, dtype: float64

In [142]:
#Question 14:
#What is the mean and standard deviation across the whole dataset for the year 2017 to 2 decimal places?
food_data.describe()

,Area Code,Item Code,Element Code,Y2014,Y2015,Y2016,Y2017,Y2018
count,60943.000000,60943.000000,60943.000000,59354.000000,59395.000000,59408.000000,59437.000000,59507.000000
mean,134.265576,2687.176706,3814.856456,134.196282,135.235966,136.555222,140.917765,143.758381
std,72.605709,146.055739,2212.007033,1567.663696,1603.403984,1640.007194,1671.862359,1710.782658
min,4.000000,2501.000000,511.000000,-1796.000000,-3161.000000,-3225.000000,-1582.000000,-3396.000000
25%,74.000000,2562.000000,684.000000,0.000000,0.000000,0.000000,0.000000,0.000000
50%,136.000000,2630.000000,5142.000000,0.090000,0.080000,0.080000,0.100000,0.070000
75%,195.000000,2775.000000,5511.000000,8.340000,8.460000,8.430000,9.000000,9.000000
max,276.000000,2961.000000,5911.000000,176405.000000,181137.000000,185960.000000,190873.000000,195875.000000

In [143]:
#Question 15:
#What is the total Protein supply quantity in Madagascar in 2015?
food_data_Madagascar = food_data[food_data['Area'] == 'Madagascar']

In [145]:
food_data_Madagascar.groupby('Element')['Y2014','Y2015', 'Y2016','Y2017', 'Y2018'].sum().loc['Protein supply quantity (g/capita/day)']

/var/folders/kc/0t29xd2n6cs931b6rpqcgzk40000gp/T/ipykernel_33516/3250806809.py:1: FutureWarning: Indexing with multiple keys (implicitly converted to a tuple of keys) will be deprecated, use a list instead.
  food_data_Madagascar.groupby('Element')['Y2014','Y2015', 'Y2016','Y2017', 'Y2018'].sum().loc['Protein supply quantity (g/capita/day)']

Y2014    177.79
Y2015    173.05
Y2016    173.40
Y2017    175.75
Y2018    176.64
Name: Protein supply quantity (g/capita/day), dtype: float64

In [146]:
#Question 17:
#Select columns ‘Y2017’ and ‘Area’, Perform a groupby operation on ‘Area’.  
# Which of these Areas had the highest sum in 2017?
ft_2017.groupby('Area').sum().sort_values(by='Y2017',ascending=False).iloc[0]

Y2017    1483268.23
Name: Nigeria, dtype: float64

In [147]:
#Question 18:
#Given the following numpy array 

array  = ([[94, 89, 63],

             [93, 92, 48],

             [92, 94, 56]])

#How would you select  the elements in bold and italics from the array?

In [148]:
array[:2,1:]

TypeError: list indices must be integers or slices, not tuple

In [110]:
#Question 20:
food_data.shape

(60943, 12)